In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [ ]:
df1.head(3)

In [ ]:
df1.tail(3)

In [3]:
#Print the name of the columns

df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [4]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [5]:
df1.shape

(7, 3)

In [6]:
print("Number of rows",df1.shape[0])

Number of rows 7

In [7]:
print("Number of columns",df1.shape[1])

Number of columns 3

In [8]:
df1.info

<bound method DataFrame.info of       Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female>

In [9]:
df1.info() #Have to use the parenthesis here

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [10]:
df1.isnull() #Have to use the parenthesis here

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [11]:
df1.isnull().sum(axis=0) # This will give the total number of null values column wise

Name      0
Marks     0
Gender    0
dtype: int64

In [12]:
df1.isnull().sum(axis=1) # This will give the total number of null values row wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [13]:
df1.describe() #This will give the statistics for the numerical columns only

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [14]:
df1.describe(include="all") #This will give the statistics for all columns

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [15]:
#for having the unique values of a column

df1["Name"].unique()

array(['Priyang', 'Aadhya', 'Krisha', 'Vedant', 'Parshv', 'Mittal',
       'Archana'], dtype=object)

In [16]:
#For the number of unique values of a column

df1["Name"].nunique()

7

In [17]:
#For the count of unique values

df1["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [18]:
#Find the number of students having marks between 90 to 100. There are many ways out there

df1[df1["Marks"]>90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [19]:
df1[(df1["Marks"]>=90) & (df1["Marks"]<100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [20]:
len(df1[(df1["Marks"]>=90) & (df1["Marks"]<100)])

4

# We can find the entity of a cell by a portion of the string by str.contains method

In [21]:
df1[df1["Gender"].str.contains("fem",case=False)]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [22]:
# Find average marks

In [23]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [24]:
df1["Marks"].mean()

92.14285714285714

In [25]:
df1[df1["Marks"]==df1["Marks"].min()]

     Name  Marks  Gender
5  Mittal     83  Female

In [26]:
df1[df1["Marks"]==df1["Marks"].max()]

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female

In [27]:
len(df1[df1["Marks"]==df1["Marks"].max()])

2

In [28]:
#Custom function 

def অর্ধেক(x):
    return x/2

In [29]:
df1["Marks"].apply(অর্ধেক)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [30]:
def একশ_গুন(x):
    return x*100

In [31]:
df1["Marks"].apply(একশ_গুন)

0    9800
1    8900
2    9900
3    8700
4    9000
5    8300
6    9900
Name: Marks, dtype: int64

In [32]:
#Lets create a new column for the half marks

def অর্ধেক(x):
    return x/2

In [33]:
df1["Half_marks"]=df1["Marks"].apply(অর্ধেক) # The column is added with the original table for ever

In [34]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [35]:
# look / is real division
5/2

2.5

In [36]:
# // is an integer division
5//2

2

In [37]:
#Map function

In [38]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [39]:
# we can create a new column by the map function

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[48,79,50,67,69,73,990],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)

In [40]:
df1

      Name  Marks  Gender
0  Priyang     48    Male
1   Aadhya     79  Female
2   Krisha     50  Female
3   Vedant     67    Male
4   Parshv     69    Male
5   Mittal     73  Female
6  Archana    990  Female

In [41]:
df1["Gender_converted"]=df1["Gender"].map({"Male": "Man", "Female": "Women"}) # can do the same thing by the aid of function(Done next)

In [42]:
df1

      Name  Marks  Gender Gender_converted
0  Priyang     48    Male              Man
1   Aadhya     79  Female            Women
2   Krisha     50  Female            Women
3   Vedant     67    Male              Man
4   Parshv     69    Male              Man
5   Mittal     73  Female            Women
6  Archana    990  Female            Women

In [43]:
def grade_marks(x):
    if 80 <= x <= 100:
        return 'A+'
    elif 60 <= x < 80:
        return 'A'
    elif 40 <= x < 60:
        return 'B'
    elif x < 40:
        return 'C'
    else:
        return 'Invalid Score'


df1['Grade'] = df1['Marks'].apply(grade_marks)

In [44]:
df1

      Name  Marks  Gender Gender_converted          Grade
0  Priyang     48    Male              Man              B
1   Aadhya     79  Female            Women              A
2   Krisha     50  Female            Women              B
3   Vedant     67    Male              Man              A
4   Parshv     69    Male              Man              A
5   Mittal     73  Female            Women              A
6  Archana    990  Female            Women  Invalid Score

In [45]:
def extra (x):
    if x =="Male":
        return "Purus"
    elif  x == "Female":
        return "Mohila"
    else:
        return "invalid" #  Here have to be careful while comming to the new line and adding space by pressing tab button,

In [46]:
df1["Gender change usinf function"]=df1["Gender"].apply(extra)

In [47]:
df1

,Name,Marks,Gender,Gender_converted,Grade,Gender change usinf function
0,Priyang,48,Male,Man,B,Purus
1,Aadhya,79,Female,Women,A,Mohila
2,Krisha,50,Female,Women,B,Mohila
3,Vedant,67,Male,Man,A,Purus
4,Parshv,69,Male,Man,A,Purus
5,Mittal,73,Female,Women,A,Mohila
6,Archana,990,Female,Women,Invalid Score,Mohila

In [48]:
# Dropping a column

In [49]:
# For removing only one column
df1.drop("Gender change usinf function",axis=1)

      Name  Marks  Gender Gender_converted          Grade
0  Priyang     48    Male              Man              B
1   Aadhya     79  Female            Women              A
2   Krisha     50  Female            Women              B
3   Vedant     67    Male              Man              A
4   Parshv     69    Male              Man              A
5   Mittal     73  Female            Women              A
6  Archana    990  Female            Women  Invalid Score

In [50]:
df1 # it will not chande the original data frame.for that have to use inplace=True

,Name,Marks,Gender,Gender_converted,Grade,Gender change usinf function
0,Priyang,48,Male,Man,B,Purus
1,Aadhya,79,Female,Women,A,Mohila
2,Krisha,50,Female,Women,B,Mohila
3,Vedant,67,Male,Man,A,Purus
4,Parshv,69,Male,Man,A,Purus
5,Mittal,73,Female,Women,A,Mohila
6,Archana,990,Female,Women,Invalid Score,Mohila

In [51]:
df1.drop("Gender change usinf function",axis=1,inplace=True)

In [52]:
df1

      Name  Marks  Gender Gender_converted          Grade
0  Priyang     48    Male              Man              B
1   Aadhya     79  Female            Women              A
2   Krisha     50  Female            Women              B
3   Vedant     67    Male              Man              A
4   Parshv     69    Male              Man              A
5   Mittal     73  Female            Women              A
6  Archana    990  Female            Women  Invalid Score

In [53]:
#For Dropping multiple columns

df1.drop(["Gender_converted","Grade"],axis=1)

      Name  Marks  Gender
0  Priyang     48    Male
1   Aadhya     79  Female
2   Krisha     50  Female
3   Vedant     67    Male
4   Parshv     69    Male
5   Mittal     73  Female
6  Archana    990  Female

In [54]:
df1

      Name  Marks  Gender Gender_converted          Grade
0  Priyang     48    Male              Man              B
1   Aadhya     79  Female            Women              A
2   Krisha     50  Female            Women              B
3   Vedant     67    Male              Man              A
4   Parshv     69    Male              Man              A
5   Mittal     73  Female            Women              A
6  Archana    990  Female            Women  Invalid Score

In [55]:
df1.drop(["Gender_converted","Grade"],axis=1,inplace=True) # Axis =0 for droppin rows

In [56]:
df1

      Name  Marks  Gender
0  Priyang     48    Male
1   Aadhya     79  Female
2   Krisha     50  Female
3   Vedant     67    Male
4   Parshv     69    Male
5   Mittal     73  Female
6  Archana    990  Female

In [57]:
#Sorting the data frame

In [58]:
df1

      Name  Marks  Gender
0  Priyang     48    Male
1   Aadhya     79  Female
2   Krisha     50  Female
3   Vedant     67    Male
4   Parshv     69    Male
5   Mittal     73  Female
6  Archana    990  Female

In [59]:
# Ascending order of the marks column

df1.sort_values(by="Marks") # This in ascending by default

      Name  Marks  Gender
0  Priyang     48    Male
2   Krisha     50  Female
3   Vedant     67    Male
4   Parshv     69    Male
5   Mittal     73  Female
1   Aadhya     79  Female
6  Archana    990  Female

In [60]:
df1.sort_values(by="Marks",ascending=False) # This is for descending order

      Name  Marks  Gender
6  Archana    990  Female
1   Aadhya     79  Female
5   Mittal     73  Female
4   Parshv     69    Male
3   Vedant     67    Male
2   Krisha     50  Female
0  Priyang     48    Male

In [61]:
# we can sort by two or more columns also

df1.sort_values(by=["Marks","Gender"],ascending=False)

      Name  Marks  Gender
6  Archana    990  Female
1   Aadhya     79  Female
5   Mittal     73  Female
4   Parshv     69    Male
3   Vedant     67    Male
2   Krisha     50  Female
0  Priyang     48    Male

In [ ]:
#Display the name and marks of the Female students only

df1[["Name","Marks"]][df1["Gender"]=="Female"]